console.log ("number"+ 3+ 3 ) // відбувається конкатинація, відповідь number33, тип - string.
//  Спочатку відповідь буде number3, далі - number33


// Приклад 2
console.log (null + 3) // null = 0, тому 0 додається до 3, результат 3

// Приклад 3
console.log (5 && "qwerty") // крок 1 - значення && приводить 5 до булевого значення true
//крок 2 - && повертає останнє правдиве значення
// Результат: "qwerty"  

console.log(+"40" + + "2" + "hillel")
// знак + перетворює строку на число , результат - 40, число
//
// + "2" - перетворює строку на число , результат - 2, число, загальний результат - результат - 42, число
// + "hillel" - додає до попередніх чисел строку, результат - 42hillel, строка, бо JS все, 
// що можна привести до строки, приводить до строки
console.log ('10' - 5 === 6)
// "10" - 5  відбуваєтся приведення строки до числа, результат 5
// === - строго порівнює 5 до 6, віддає результат false
console.log (true + false)
// true перетворюється на 1 + false перетворюється на 0. Результат 1
console.log ('4px' - 3)
// JS намагається привести строку до числа, і оскільки є значення px- не виходить
// отримуємо відповідь NaN
console.log ('4' - 3) // відбуваєтся приведення строки до числа, результат 1
console.log('6' + 3 ** 0)
// спочатку відбувається піднесення до нульового степеня 3 ** 0, що завжди =1
// далі '6' - строка, додається до числа і як результат - строка, 61ʼ
console.log (12 / '6') // 6 - приводиться до числа, результат 2

console.log ('10' + (5 === 6))// 10 строкою додається до false, оскільки 5 не дорівнює строго 6. 
// Результат 10false

console.log (null == '') // null порівнює не строго з пустою строкою, він їй не дорівнює, і результат false

console.log (3 ** (9 / 3)) // спочатку виконується операція в дужках - 9/3=3
// далі 3 приводиться до степеня 3 (результат з дужок) = 27

console.log (!!'false' == !!'true') // !! приводить рядок до булевого типу
// далі відбувається нестроге порівняння true + true ( бо не пустий рядок), і в консоль виведе true

console.log (0 || '0' && 1)// спочатку виконається '0' && 1 - поверне 1
//(останнє істинне значення). Далі 00 || 1 - поверне 1, бо це перше істинне значення

console.log((+null == false) < 1)// + null - приводится до числа, що =0.
//дальше відбувається шось сложне. 0 == false, робить false нульом, і вони двоє
//магічним чином перетворюються в тру.
// ну а тру - це 1. 1 не менше і не більше одиниці тому фолс.
console.log(false && true || true)// спочатку виконується false && true
// повертає тру - останнє істине значення. Далі true || true - повертає
//перше істинне значення, true. Результат - true

console.log(false && (false || true))// спочатку спрацьовує false || true
// повертає перше істинне значення - true. Далі спрацьовує alse &&  true,
// що повертає перше хибне значення. Результат - false


console.log((+null == false) < 1 ** 5)
//+ null - приводится до числа, що =0/ Далі, як і написала зверху, результат і дужках буде true
// маємо  true < 1 ** 5/ Перше виконується приведення до степені 1 ** 5 = 1
// далі маємо true < 1, а true рівно 1, тому це фолс